//  เขียนฟังก์ชัน login ตรวจสอบตามลำดับ


function login(inputUser, inputPass, role, isActive, age) {
        // ตรวจสอบ username หรือ password (ใช้เครื่องหมาย || แทนหรือ)
    if (inputUser !== "admin" || inputPass !== "ce385pass") {
        return "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";
    }
        // ตรวจสอบบัญชีถูกระงับ 
    if (isActive === false) {
        return "บัญชีนี้ถูกระงับการใช้งาน";
    }
         //  ตรวจสอบอายุ
    if (age < 18) {
        return "อายุไม่ถึงเกณฑ์";
    }
        // 4 กับ 5 คือ ตรวจสอบสิทธิ์ 
    if (role === "อาจารย์") {
        return "เข้าสู่ระบบสำเร็จ (สิทธ์ผู้ดูแล)";
    }
    else if (role === "นักศึกษา") {
        return "เข้าสู้ระบบสำเร็จ (สิทธิ์ทั่วไป)";
    }
    else {
        return "สิทธิ์ไม่ถูกต้อง"; 
    }
}


    // ทดสอบอย่างน้อย 6 กรณี
console.log(" Login ");
console.log("   สำเร็จ (อาจารย์) :", login("admin", "ce385pass", "อาจารย์", true, 30));
console.log("   สำเร็จ (นักศึกษา) :", login("admin", "ce385pass", "นักศึกษา", true, 22));
console.log("   รหัสผ่านผิด :", login("admin", "pass444", "นักศึกษา", true, 22));
console.log("   ชื่อผู้ใช้ผิด :", login("admidAD", "ce385pass", "อาจารย์", true, 30));
console.log("   บัญชีถูกระงับ :", login("admin", "ce385pass", "อาจารย์", false, 30));
console.log("   อายุไม่ถึง :", login("admin", "ce385pass", "นักศึกษา", true, 16));



        //ตอบคำถามท้ายข้อ
    /*
    ทำไมต้องตรวจ username/password ก่อน ตรวจ role?

ตอบ: เพราะระบบต้องยืนยันตัวตนให้ผ่านก่อนว่าเป็นตัวจริงจึงจะสามารถตรวจสอบสิทธิ์ได้แต่ถ้าเช็คสิทธิ์ก่อน 
ก็อาจเป็นการเปิดช่องโหว่ให้บุคคลที่ไม่เกี่ยวข้องรู้โครงสร้างข้อมูลภายในว่าระบบมี role ยังไงบ้างโดยที่ไม่จำเป็นต้องยืนยันตัวตนเลย


    ถ้าย้ายการตรวจ "อายุไม่ถึงเกณฑ์" ขึ้นไปเป็นข้อแรกจะเกิดปัญหาอะไร? (คิดในแง่ความปลอดภัย: เราจะบอกอะไรกับคนยังไม่ได้พิสูจน์ตัวตน)

ตอบ: ในแง่ความปลอดภัย เราต้องไม่เปิดเผยข้อมูลต่างๆให้กับบุคคลภายนอกที่ยังไม่ได้ยืนยันรหัสผ่าน  
เราจึงต้องมีการตรวจสอบชื่อผู้ใช้-รหัสผ่านและอายุที่ไม่ถึงเกณฑ์ เพื่อป้องกันไม่ให้ระบบข้อมูลรั่วไหลออกไปได้*/
